Documents/ESB/ESB_Consumer_0728/003TestSample/SAMPLE_XML_MUST/Limit/LI07_LmtWOFeeAddRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/Limit/LmtWOFeeAddRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>Limit</ServiceDomain>  
      <OperationName>LmtWOFeeAdd</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:LmtWOFeeAddRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>LI07</v11:TxnId>  
        <v11:TxnNo>LI0700001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:ValidateOnly>false</v11:ValidateOnly>  
        <v11:LmtId>NEW</v11:LmtId>  
        <v11:CIFNo>1000000679</v11:CIFNo>  
        <v11:LmtProdId>8100</v11:LmtProdId>  
        <v11:AppNo>ELOAN1234</v11:AppNo>  
        <v11:Ccy>TWD</v11:Ccy>  
        <v11:AvailFlg>Y</v11:AvailFlg>  
        <v11:ApprvDate>20191203</v11:ApprvDate>  
        <v11:DfltApprvDate>20191203</v11:DfltApprvDate>  
        <v11:RvwFreq>20201203M0101</v11:RvwFreq>  
        <v11:LmtExpDate>20201203</v11:LmtExpDate>  
        <v11:AppDate>20191203</v11:AppDate>  
        <v11:LmtEffData>20191203</v11:LmtEffData>  
        <v11:ExtblLmtExpDate>20201204</v11:ExtblLmtExpDate>  
        <v11:LmtAmt>40000</v11:LmtAmt>  
        <v11:MaxLmtAmt>40000</v11:MaxLmtAmt>  
        <v11:LmtType>FIXED</v11:LmtType>  
        <v11:AllwLmtCancFlg>1</v11:AllwLmtCancFlg>  
        <v11:LmtCtrctExpDate>20271203</v11:LmtCtrctExpDate>  
        <!--Zero or more repetitions:-->  
        <v11:OvrrdRec></v11:OvrrdRec>  
        <!--Zero or more repetitions:-->  
        <v11:UpdtDateRec></v11:UpdtDateRec>  
        <!--Optional:-->  
        <v11:APIKey>IF05005</v11:APIKey> 
      </v11:ServiceBody> 
    </v11:LmtWOFeeAddRq> 
  </soap:Body> 
</soap:Envelope>
